Revit 2027 API
BuiltInFailures.RebarFailures.RebarEndTreatmentOverHook Property
 Cannot add end treatment to the end that already has a hook.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarEndTreatmentOverHook { get; }
Public Shared ReadOnly Property RebarEndTreatmentOverHook As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarEndTreatmentOverHook {
	FailureDefinitionId^ get ();
}
static member RebarEndTreatmentOverHook : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace